---
type: FilterNumericRuleEvaluator
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FilterNumericRuleEvaluator

`Autodesk.Revit.DB.FilterNumericRuleEvaluator` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Evaluate | — | `` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |